{"0": "<PAD>", "1": "<EOS>", "2": "<UNK>", "3": "<GO>", "4": "is", "5": "1.0.", "6": "performed", "7": "angle", "8": "less", "9": "absolute", "10": "correctly", "11": "arguments.", "12": "long.", "13": "closer", "14": "logarithms.", "15": "values.", "16": "value.", "17": "by", "18": "multiply", "19": "rounded", "20": "equivalent", "21": "arc", "22": "ieee", "23": "rounding", "24": "algebraic", "25": "its", "26": "infinity.", "27": "converts", "28": "arguments", "29": "value", "30": "negative", "31": "128-bit", "32": "throwing", "33": "adjacent", "34": "2scalefactor", "35": "remainder", "36": "on", "37": "-pi/2", "38": "circumference", "39": "exponent", "40": "ex\u00a0-1.", "41": "ties", "42": "two", "43": "int", "44": "any", "45": "single", "46": "value;", "47": "difference", "48": "smallest", "49": "radians.", "50": "pi/2.", "51": "then", "52": "radians", "53": "-1.0", "54": "without", "55": "argument;", "56": "standard.", "57": "signum", "58": "1.", "59": "equal", "60": "zero,", "61": "than", "62": "third", "63": "double.", "64": "theta", "65": "euler's", "66": "second", "67": "intermediate", "68": "significant", "69": "if", "70": "conversion", "71": "d", "72": "first", "73": "decremented", "74": "closest", "75": "diameter.", "76": "sum", "77": "pi,", "78": "infinity)", "79": "float.", "80": "modulus", "81": "approximately", "82": "number", "83": "set.", "84": "function", "85": "base", "86": "an", "87": "negation", "88": "through", "89": "fused", "90": "ulp", "91": "integer.", "92": "64", "93": "returned", "94": "arguments;", "95": "greater", "96": "0.0", "97": "\u00d7", "98": "overflows", "99": "mathematical", "100": "most", "101": "once", "102": "(base", "103": "1.0", "104": "argument.", "105": "int.", "106": "cube", "107": "-1.0f", "108": "exception", "109": "sign,", "110": "coordinates", "111": "floating-point", "112": "largest", "113": "argument,", "114": "measured", "115": "that", "116": "(closest", "117": "sine", "118": "root", "119": "zero.", "120": "hyperbolic", "121": "computes", "122": "10", "123": "nearest", "124": "as", "125": "polar", "126": "add", "127": "member", "128": "angle.", "129": "factors.", "130": "sign", "131": "1.0f", "132": "e)", "133": "(x,\u00a0y)", "134": "of", "135": "operation", "136": "size", "137": "prescribed", "138": "one,", "139": "ratio", "140": "floor", "141": "e", "142": "long", "143": "sqrt(x2\u00a0+y2)", "144": "cosine", "145": "power", "146": "zero", "147": "positive", "148": "or", "149": "range", "150": "representation", "151": "incremented", "152": "smaller", "153": "tangent", "154": "raised", "155": "double", "156": "and", "157": "other", "158": "used", "159": "bits", "160": "unbiased", "161": "rectangular", "162": "trigonometric", "163": "natural", "164": "pi.", "165": "circle", "166": "exact", "167": "product", "168": "returns", "169": "with", "170": "argument", "171": "degrees.", "172": "arguments,", "173": "(r,\u00a0theta).", "174": "64-bit", "175": "754", "176": "f", "177": "to", "178": "logarithm", "179": "quotient.", "180": "square", "181": "degrees", "182": "in", "183": "a", "184": "summed", "185": "float", "186": "is,", "187": "underflow.", "188": "e,", "189": "from", "190": "overflow", "191": "the", "192": "direction", "193": "result", "194": "three"}