{"(base": 102, "(closest": 116, "(r,\u00a0theta).": 173, "(x,\u00a0y)": 133, "-1.0": 53, "-1.0f": 107, "-pi/2": 37, "0.0": 96, "1.": 58, "1.0": 103, "1.0.": 5, "1.0f": 131, "10": 122, "128-bit": 31, "2scalefactor": 34, "64": 92, "64-bit": 174, "754": 175, "<EOS>": 1, "<GO>": 3, "<PAD>": 0, "<UNK>": 2, "a": 183, "absolute": 9, "add": 126, "adjacent": 33, "algebraic": 24, "an": 86, "and": 156, "angle": 7, "angle.": 128, "any": 44, "approximately": 81, "arc": 21, "argument": 170, "argument,": 113, "argument.": 104, "argument;": 55, "arguments": 28, "arguments,": 172, "arguments.": 11, "arguments;": 94, "as": 124, "base": 85, "bits": 159, "by": 17, "circle": 165, "circumference": 38, "closer": 13, "closest": 74, "computes": 121, "conversion": 70, "converts": 27, "coordinates": 110, "correctly": 10, "cosine": 144, "cube": 106, "d": 71, "decremented": 73, "degrees": 181, "degrees.": 171, "diameter.": 75, "difference": 47, "direction": 192, "double": 155, "double.": 63, "e": 141, "e)": 132, "e,": 188, "equal": 59, "equivalent": 20, "euler's": 65, "exact": 166, "exception": 108, "exponent": 39, "ex\u00a0-1.": 40, "f": 176, "factors.": 129, "first": 72, "float": 185, "float.": 79, "floating-point": 111, "floor": 140, "from": 189, "function": 84, "fused": 89, "greater": 95, "hyperbolic": 120, "ieee": 22, "if": 69, "in": 182, "incremented": 151, "infinity)": 78, "infinity.": 26, "int": 43, "int.": 105, "integer.": 91, "intermediate": 67, "is": 4, "is,": 186, "its": 25, "largest": 112, "less": 8, "logarithm": 178, "logarithms.": 14, "long": 142, "long.": 12, "mathematical": 99, "measured": 114, "member": 127, "modulus": 80, "most": 100, "multiply": 18, "natural": 163, "nearest": 123, "negation": 87, "negative": 30, "number": 82, "of": 134, "on": 36, "once": 101, "one,": 138, "operation": 135, "or": 148, "other": 157, "overflow": 190, "overflows": 98, "performed": 6, "pi,": 77, "pi.": 164, "pi/2.": 50, "polar": 125, "positive": 147, "power": 145, "prescribed": 137, "product": 167, "quotient.": 179, "radians": 52, "radians.": 49, "raised": 154, "range": 149, "ratio": 139, "rectangular": 161, "remainder": 35, "representation": 150, "result": 193, "returned": 93, "returns": 168, "root": 118, "rounded": 19, "rounding": 23, "second": 66, "set.": 83, "sign": 130, "sign,": 109, "significant": 68, "signum": 57, "sine": 117, "single": 45, "size": 136, "smaller": 152, "smallest": 48, "sqrt(x2\u00a0+y2)": 143, "square": 180, "standard.": 56, "sum": 76, "summed": 184, "tangent": 153, "than": 61, "that": 115, "the": 191, "then": 51, "theta": 64, "third": 62, "three": 194, "through": 88, "throwing": 32, "ties": 41, "to": 177, "trigonometric": 162, "two": 42, "ulp": 90, "unbiased": 160, "underflow.": 187, "used": 158, "value": 29, "value.": 16, "value;": 46, "values.": 15, "with": 169, "without": 54, "zero": 146, "zero,": 60, "zero.": 119, "\u00d7": 97}